# Building an Entity Normalization Engine

This notebook contains experiments in an attempt to build an entity normalization engine. The input to this engine is short strings that could encompass the following entities: company names, company addresses, serial numbers, physical goods and locations.

The task is divided into 2 parts:

**Part 1**: Build a system that can identify unique entities for each category above. Some of these will be trivial (remove spaces, edit distance) while others are more complicated and will need a trained model / some other form of knowledge and guidance.

**Part 2**: Build a system that receives strings one by one and groups together any entities that have passed through the system previously. Check the latest sample received, scan the entries already received, identify if the entity is a duplicate and then add it to a cluster / create a new cluster depending on the result.

Here are fictional examples of the strings we will be dealing with:

- Company names: “Marks and Spencers Ltd”, “M&S Limited”, “NVIDIA Ireland”
- Company addresses: “SLOUGH SE12 2XY”, “33 TIMBER YARD, LONDON, L1 8XY”, “44 CHINA ROAD, KOWLOON, HONG KONG”
- Serial numbers: “XYZ 13423 / ILD”, “ABC/ICL/20891NC”
- Physical Goods: “HARDWOOD TABLE”, “PLASTIC BOTTLE”
- Locations: “LONDON”, “HONG KONG”, “ASIA”

## Part 1: Category-Specific Normalization Engines

The general, theoretical approach here is:

*Step 1* - Text preprocessing: standardizing lettercase, punctuation, whitespace, accented/special characters, legal control terms (Ltd, Co, etc) depending on which category we are dealing with

*Step 2* - Entity clustering: use string_grouper library that uses TF-IDF (Term Frequency multiplied by Inverse Document Frequency) with N-Grams to calculate cosine similarities within a single Series of strings and groups them by assigning to each string one string from the group chosen as the group-representative for each group of similar strings found.

The code for both these steps will vary depending on the category we are dealing with. We can address the categories one by one in ascending order of difficulty. Functions are created for each in order to copy them to python scripts efficiently.

*Note: Original idea was to create for each category string similarity matrix with similarity metric such as levenshtein distance, Jaro-Winkler or caverphone algorithm. Next, use clustering algorithm to cluster entities; affinity propagation seems to be standard for this task. For each unique entity (cluster) assign substring with the longest string length as the standard name for that cluster. I experimented with these approach but found the chosen approach to be quicker to execute, more legible and have better performance.*

### Serial Numbers

We expect minimal pre-processing to be done for serial numbers and rely on a very high similarity threshold for matching strings. It's actually better to just group the strings directly after pre-processing, but we might as well just use the string grouper function to keep the process standard for all categories.

In [1]:
import pandas as pd

# create a sample df for serial numbers from manually generated list
serial_nums = ["XYZ 13423 / ILD", "ABC/ICL/20891NC", "XYZ-13423-ILD", "ABCICL-20891NC", "XYZ 14 / IKR", "DNC/ICL/20891NC", "XYK-13423-ILD"]
df_serial_nums = pd.DataFrame(serial_nums, columns=['serial_nums'])

In [2]:
df_serial_nums

       serial_nums
0  XYZ 13423 / ILD
1  ABC/ICL/20891NC
2    XYZ-13423-ILD
3   ABCICL-20891NC
4     XYZ 14 / IKR
5  DNC/ICL/20891NC
6    XYK-13423-ILD

In [3]:
import re
import numpy as np

# remove special characters function
def remove_special_characters(text):
    pattern = r'[^a-zA-z0-9\s]'
    text = re.sub(pattern, '', text)
    return text

# preprocess function for dataframe of serial numbers - provide dataframe and column name for serial nums as input
def preprocess_serial_nums(dataframe, column_name):
    clean_list = [remove_special_characters(text) for text in dataframe[column_name]] 
    clean_list = [text.lower() for text in clean_list]
    clean_list = [text.replace(' ', '') for text in clean_list] # remove all whitespaces
    df_clean_serial_nums = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['serial_nums', 'clean_serial_nums'])
    return df_clean_serial_nums

In [4]:
df_serial_nums_cleaned = preprocess_serial_nums(df_serial_nums, 'serial_nums'); df_serial_nums_cleaned

       serial_nums clean_serial_nums
0  XYZ 13423 / ILD       xyz13423ild
1  ABC/ICL/20891NC     abcicl20891nc
2    XYZ-13423-ILD       xyz13423ild
3   ABCICL-20891NC     abcicl20891nc
4     XYZ 14 / IKR          xyz14ikr
5  DNC/ICL/20891NC     dncicl20891nc
6    XYK-13423-ILD       xyk13423ild

In [5]:
from string_grouper import group_similar_strings

# entity matching function for dataframe created at preprocessing stage - provide dataframe and original column name for serial nums
def entity_matcher_serial_nums(dataframe, column_name):
    # group entities using tf-idf to calculate cosine similarities - look for 99% minimum similarity
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_serial_nums'], min_similarity = 0.99)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])[column_name].apply('; '.join).reset_index()
    return dataframe

In [6]:
df_unique_entities_serial_nums = entity_matcher_serial_nums(df_serial_nums_cleaned, 'serial_nums'); df_unique_entities_serial_nums

   unique_entity_ID  unique_entity                      serial_nums
0                 0    xyz13423ild   XYZ 13423 / ILD; XYZ-13423-ILD
1                 1  abcicl20891nc  ABC/ICL/20891NC; ABCICL-20891NC
2                 4       xyz14ikr                     XYZ 14 / IKR
3                 5  dncicl20891nc                  DNC/ICL/20891NC
4                 6    xyk13423ild                    XYK-13423-ILD

In [7]:
import time

# function for processing df of serial numbers and clustering them using string similarity
def clustering_serial_nums(dataframe, column_name):
    # preprocess dataframe
    df_serial_nums_cleaned = preprocess_serial_nums(dataframe, column_name)
    # start clustering of serial nums
    print('Entity clustering will start now.')
    start = time.time()
    df_unique_entities_serial_nums = entity_matcher_serial_nums(df_serial_nums_cleaned, column_name)
    time.sleep(1)
    end = time.time()
    # print total time taken
    print(f"Runtime of the program is {end - start} seconds.")
    # create csv with timestamp
    current_time = time.strftime("%Y%m%d-%H%M%S")
    filename = 'serial_num_normalized' + str(current_time) + '.csv'
    # print job status
    print(f"{filename} has been saved in current directory.")
    return df_unique_entities_serial_nums.to_csv(filename, index = False)

In [8]:
clustering_serial_nums(df_serial_nums, 'serial_nums')

Entity clustering will start now.
Runtime of the program is 1.014404296875 seconds.
serial_num_normalized20210727-114535.csv has been saved in current directory.

In [9]:
# inspect results
pd.read_csv('serial_num_normalized20210725-235347.csv')

   unique_entity_ID  unique_entity                      serial_nums
0                 0    xyz13423ild   XYZ 13423 / ILD; XYZ-13423-ILD
1                 1  abcicl20891nc  ABC/ICL/20891NC; ABCICL-20891NC
2                 4       xyz14ikr                     XYZ 14 / IKR
3                 5  dncicl20891nc                  DNC/ICL/20891NC
4                 6    xyk13423ild                    XYK-13423-ILD

### Company Addresses

This category is actually quite tricky, but we won't attempt to dive too deep into it for this exercise. We can simplify things and pretend that addresses can be addressed similarly to serial numbers. In reality address parsing and normalization is extremely tricky especially because even the simplest addresses are packed with local conventions, abbreviations and context. If we had to address this head-on we would use the [libpostal](https://github.com/openvenues/libpostal) library. It converts free-form addresses that humans use into clean normalized forms suitable for machine comparison and full-text indexing.

In [10]:
# create a sample df for addresses from manually generated list
addresses = ["SLOUGH SE12 2XY", "33 TIMBER YARD, LONDON, L1 8XY", "44 CHINA ROAD, KOWLOON, HONG KONG", "33, TIMBER YARD, LONDON, L1 8XY"]
df_addresses = pd.DataFrame(addresses, columns=['addresses'])

In [11]:
df_addresses

                           addresses
0                    SLOUGH SE12 2XY
1     33 TIMBER YARD, LONDON, L1 8XY
2  44 CHINA ROAD, KOWLOON, HONG KONG
3    33, TIMBER YARD, LONDON, L1 8XY

In [12]:
# preprocess function for dataframe of addresses - provide dataframe and column name for addresses as input
def preprocess_addresses(dataframe, column_name):
    clean_list = [remove_special_characters(text) for text in dataframe[column_name]] 
    clean_list = [text.lower() for text in clean_list]
    clean_list = [text.replace('  ', ' ') for text in clean_list] # remove extra whitespaces
    clean_list = [text.strip() for text in clean_list]
    df_clean_addresses = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['addresses', 'clean_addresses'])
    return df_clean_addresses

In [13]:
df_addresses_cleaned = preprocess_addresses(df_addresses, 'addresses'); df_addresses_cleaned

                           addresses                  clean_addresses
0                    SLOUGH SE12 2XY                  slough se12 2xy
1     33 TIMBER YARD, LONDON, L1 8XY     33 timber yard london l1 8xy
2  44 CHINA ROAD, KOWLOON, HONG KONG  44 china road kowloon hong kong
3    33, TIMBER YARD, LONDON, L1 8XY     33 timber yard london l1 8xy

In [14]:
# entity matching function for dataframe created at preprocessing stage - provide dataframe and original column name for addresses
def entity_matcher_addresses(dataframe, column_name):
    # group entities using tf-idf to calculate cosine similarities - look for 99% minimum similarity
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_addresses'], min_similarity = 0.99)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])[column_name].apply('; '.join).reset_index()
    return dataframe

In [15]:
df_unique_entities_addresses = entity_matcher_addresses(df_addresses_cleaned, 'addresses'); df_unique_entities_addresses

,unique_entity_ID,unique_entity,addresses
0,0,slough se12 2xy,SLOUGH SE12 2XY
1,1,33 timber yard london l1 8xy,"33 TIMBER YARD, LONDON, L1 8XY; 33, TIMBER YAR..."
2,2,44 china road kowloon hong kong,"44 CHINA ROAD, KOWLOON, HONG KONG"

In [16]:
# function for processing df of addresses and clustering them using string similarity
def clustering_addresses(dataframe, column_name):
    # preprocess dataframe
    df_addresses_cleaned = preprocess_addresses(dataframe, column_name)
    # start clustering of addresses
    print('Entity clustering will start now.')
    start = time.time()
    df_unique_entities_addresses = entity_matcher_addresses(df_addresses_cleaned, column_name)
    time.sleep(1)
    end = time.time()
    # print total time taken
    print(f"Runtime of the program is {end - start} seconds.")
    # create csv with timestamp
    current_time = time.strftime("%Y%m%d-%H%M%S")
    filename = 'addresses_normalized' + str(current_time) + '.csv'
    # print job status
    print(f"{filename} has been saved in current directory.")
    return df_unique_entities_addresses.to_csv(filename, index = False)

In [17]:
clustering_addresses(df_addresses, 'addresses')

Entity clustering will start now.
Runtime of the program is 1.0182220935821533 seconds.
addresses_normalized20210727-114536.csv has been saved in current directory.

In [18]:
# inspect results
pd.read_csv('addresses_normalized20210725-235415.csv')

,unique_entity_ID,unique_entity,addresses
0,0,slough se12 2xy,SLOUGH SE12 2XY
1,1,33 timber yard london l1 8xy,"33 TIMBER YARD, LONDON, L1 8XY; 33, TIMBER YAR..."
2,2,44 china road kowloon hong kong,"44 CHINA ROAD, KOWLOON, HONG KONG"

### Physical Goods

For this category we can start using similarity thresholds that are lower. We start getting into entities that would make more sense to use a language model with. We'll stick with the TF-IDF cosine similarity approach for the sake of this exercise and see if it does the job.

In [19]:
# create a sample df for physical goods from manually generated list
goods = ["HARDWOOD TABLE", "PLASTIC BOTTLE", "TOYS", "plastic water bottle", "Wooden Table", "ALUMINIUM TABLE"]
df_goods = pd.DataFrame(goods, columns=['goods'])

In [20]:
df_goods

                  goods
0        HARDWOOD TABLE
1        PLASTIC BOTTLE
2                  TOYS
3  plastic water bottle
4          Wooden Table
5       ALUMINIUM TABLE

In [21]:
# preprocess function for dataframe of goods - provide dataframe and column name for goods as input
def preprocess_goods(dataframe, column_name):
    clean_list = [remove_special_characters(text) for text in dataframe[column_name]] 
    clean_list = [text.lower() for text in clean_list]
    clean_list = [text.replace('  ', ' ') for text in clean_list] # remove extra whitespaces
    clean_list = [text.strip() for text in clean_list]
    df_clean_goods = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['goods', 'clean_goods'])
    return df_clean_goods

In [22]:
df_goods_cleaned = preprocess_goods(df_goods, 'goods'); df_goods_cleaned

                  goods           clean_goods
0        HARDWOOD TABLE        hardwood table
1        PLASTIC BOTTLE        plastic bottle
2                  TOYS                  toys
3  plastic water bottle  plastic water bottle
4          Wooden Table          wooden table
5       ALUMINIUM TABLE       aluminium table

In [23]:
# entity matching function for dataframe created at preprocessing stage - provide dataframe and original column name for goods
def entity_matcher_goods(dataframe, column_name):
    # group entities using tf-idf to calculate cosine similarities - look for 30% minimum similarity
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_goods'], min_similarity = 0.3)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])[column_name].apply('; '.join).reset_index()
    return dataframe

In [24]:
df_unique_entities_goods = entity_matcher_goods(df_goods_cleaned, 'goods'); df_unique_entities_goods

   unique_entity_ID    unique_entity                                 goods
0                 0   hardwood table          HARDWOOD TABLE; Wooden Table
1                 1   plastic bottle  PLASTIC BOTTLE; plastic water bottle
2                 2             toys                                  TOYS
3                 5  aluminium table                       ALUMINIUM TABLE

In [25]:
# function for processing df of goods and clustering them using string similarity
def clustering_goods(dataframe, column_name):
    # preprocess dataframe
    df_goods_cleaned = preprocess_goods(dataframe, column_name)
    # start clustering of goods
    print('Entity clustering will start now.')
    start = time.time()
    df_unique_entities_goods = entity_matcher_goods(df_goods_cleaned, column_name)
    time.sleep(1)
    end = time.time()
    # print total time taken
    print(f"Runtime of the program is {end - start} seconds.")
    # create csv with timestamp
    current_time = time.strftime("%Y%m%d-%H%M%S")
    filename = 'goods_normalized' + str(current_time) + '.csv'
    # print job status
    print(f"{filename} has been saved in current directory.")
    return df_unique_entities_goods.to_csv(filename, index = False)

In [26]:
clustering_goods(df_goods, 'goods')

Entity clustering will start now.
Runtime of the program is 1.0255978107452393 seconds.
goods_normalized20210727-114538.csv has been saved in current directory.

In [27]:
# inspect results
pd.read_csv('goods_normalized20210725-235445.csv')

   unique_entity_ID    unique_entity                                 goods
0                 0   hardwood table          HARDWOOD TABLE; Wooden Table
1                 1   plastic bottle  PLASTIC BOTTLE; plastic water bottle
2                 2             toys                                  TOYS
3                 5  aluminium table                       ALUMINIUM TABLE

### Locations

Once again, it would make more sense to use a language model for this task, but since the TF-IDF cosine similarity approach performed okay with physical goods, we can definitely use it for locations.

In [28]:
# create a sample df for locations from manually generated list
locations = ["LONDON", "HONG KONG", "ASIA", "LONDON, ENG", "LONDON, GREAT BRITAIN", "LONDON, ENGLAND"]
df_locations = pd.DataFrame(locations, columns=['locations'])

In [29]:
df_locations

               locations
0                 LONDON
1              HONG KONG
2                   ASIA
3            LONDON, ENG
4  LONDON, GREAT BRITAIN
5        LONDON, ENGLAND

In [30]:
# preprocess function for dataframe of locations - provide dataframe and column name for locations as input
def preprocess_locations(dataframe, column_name):
    clean_list = [remove_special_characters(text) for text in dataframe[column_name]] 
    clean_list = [text.lower() for text in clean_list]
    clean_list = [text.replace('  ', ' ') for text in clean_list] # remove extra whitespaces
    clean_list = [text.strip() for text in clean_list]
    df_clean_locations = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['locations', 'clean_locations'])
    return df_clean_locations

In [31]:
df_locations_cleaned = preprocess_locations(df_locations, 'locations'); df_locations_cleaned

               locations       clean_locations
0                 LONDON                london
1              HONG KONG             hong kong
2                   ASIA                  asia
3            LONDON, ENG            london eng
4  LONDON, GREAT BRITAIN  london great britain
5        LONDON, ENGLAND        london england

In [32]:
# entity matching function for dataframe created at preprocessing stage - provide dataframe and original column name for locations
def entity_matcher_locations(dataframe, column_name):
    # group entities using tf-idf to calculate cosine similarities - look for 30% minimum similarity
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_locations'], min_similarity = 0.3)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])[column_name].apply('; '.join).reset_index()
    return dataframe

In [33]:
df_unique_entities_locations = entity_matcher_locations(df_locations_cleaned, 'locations'); df_unique_entities_locations

,unique_entity_ID,unique_entity,locations
0,0,london,"LONDON; LONDON, ENG; LONDON, GREAT BRITAIN; LO..."
1,1,hong kong,HONG KONG
2,2,asia,ASIA

In [34]:
# function for processing df of locations and clustering them using string similarity
def clustering_locations(dataframe, column_name):
    # preprocess dataframe
    df_locations_cleaned = preprocess_locations(dataframe, column_name)
    # start clustering of locations
    print('Entity clustering will start now.')
    start = time.time()
    df_unique_entities_locations = entity_matcher_locations(df_locations_cleaned, column_name)
    time.sleep(1)
    end = time.time()
    # print total time taken
    print(f"Runtime of the program is {end - start} seconds.")
    # create csv with timestamp
    current_time = time.strftime("%Y%m%d-%H%M%S")
    filename = 'locations_normalized' + str(current_time) + '.csv'
    # print job status
    print(f"{filename} has been saved in current directory.")
    return df_unique_entities_locations.to_csv(filename, index = False)

In [35]:
clustering_locations(df_locations, 'locations')

Entity clustering will start now.
Runtime of the program is 1.017829179763794 seconds.
locations_normalized20210727-114539.csv has been saved in current directory.

In [36]:
# inspect results
pd.read_csv('locations_normalized20210725-235520.csv')

,unique_entity_ID,unique_entity,locations
0,0,london,"LONDON; LONDON, ENG; LONDON, GREAT BRITAIN; LO..."
1,1,hong kong,HONG KONG
2,2,asia,ASIA

### Company Names

The approach we used for all categories could probably work for company names, but it could be interesting to try out something that I think could work quite well for company names: scraping the first link that comes up when performing a google search for each company name we have. We can compare this with the approach we used until now and compare performance.

In [37]:
names = [
"Marks and Spencers Ltd", 
"M&S Limited",
"NVIDIA Ireland",
"Intel LLC",
"AT & T",
"AT & T MOBILITY",
"AT&T",
"AT&T MOBILITY",
"DELL INC.",
"WAL-MART COMMUNITY",
"WALMART PAYMENTS",
"PITNEY BOWES",
"PITNEY BOWES GLOBAL FINANCIAL",
"PITNEY BOWES, INC",
"ORACLE", 
"ORACLE AMERICA INC", 
"ORACLE CORPORATION", 
"ORACLE USA INC"]

In [38]:
df_names = pd.DataFrame(names, columns=['names'])

In [39]:
from googlesearch import search
    
# preprocess function for dataframe of locations - provide dataframe and column name for locations as input
def google_names(dataframe, column_name):
    clean_list = [list(search(text, tld="com", num=1, stop=1, pause=0.1))[0] for text in dataframe[column_name]] 
    df_clean_names = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['comp_names', 'google_comp_names'])
    return df_clean_names

In [40]:
df_names_cleaned = google_names(df_names, 'names'); df_names_cleaned

,comp_names,google_comp_names
0,Marks and Spencers Ltd,https://www.marksandspencer.com/
1,M&S Limited,https://www.marksandspencer.com/ie/l/women/lim...
2,NVIDIA Ireland,https://shop.nvidia.com/en-us/
3,Intel LLC,https://software.intel.com/content/www/us/en/d...
4,AT & T,https://www.att.com/
5,AT & T MOBILITY,https://www.att.com/wireless/
6,AT&T,https://www.att.com/
7,AT&T MOBILITY,https://www.att.com/wireless/
8,DELL INC.,https://www.dell.com/
9,WAL-MART COMMUNITY,https://walmart.org/what-we-do/strengthening-c...
10,WALMART PAYMENTS,https://www.walmart.com/cp/walmart-pay/3205993
11,PITNEY BOWES,https://www.pitneybowes.com/us
12,PITNEY BOWES GLOBAL FINANCIAL,https://www.pitneybowes.com/us/financial-servi...
13,"PITNEY BOWES, INC",https://www.pitneybowes.com/us
14,ORACLE,https://www.oracle.com/index.html
15,ORACLE AMERICA INC,https://www.oracle.com/corporate/
16,ORACLE CORPORATION,https://commons.wikimedia.org/wiki/File:Logo_o...
17,ORACLE USA INC,https://www.oracle.com/corporate/

This approach is not giving great results and most of all it's extremely slow. It might be better to revert back to the original idea.

In [41]:
df_names = pd.DataFrame(names, columns=['names'])

In [42]:
from cleanco import cleanco

# preprocess function for dataframe of names - provide dataframe and column name for names as input
def preprocess_names(dataframe, column_name):
    clean_list = [remove_special_characters(text) for text in dataframe[column_name]] 
    clean_list = [text.lower() for text in clean_list]
    clean_list = [text.replace('  ', ' ') for text in clean_list] # remove extra whitespaces
    clean_list = [text.strip() for text in clean_list]
    clean_list = [cleanco(text).clean_name() for text in clean_list] # remove legal control terms
    df_clean_names = pd.DataFrame(np.column_stack([dataframe[column_name], clean_list]), columns=['names', 'clean_names'])
    return df_clean_names

In [43]:
df_names_cleaned = preprocess_names(df_names, 'names'); df_names_cleaned

                            names                    clean_names
0          Marks and Spencers Ltd             marks and spencers
1                     M&S Limited                             ms
2                  NVIDIA Ireland                 nvidia ireland
3                       Intel LLC                          intel
4                          AT & T                           at t
5                 AT & T MOBILITY                  at t mobility
6                            AT&T                            att
7                   AT&T MOBILITY                   att mobility
8                       DELL INC.                           dell
9              WAL-MART COMMUNITY              walmart community
10               WALMART PAYMENTS               walmart payments
11                   PITNEY BOWES                   pitney bowes
12  PITNEY BOWES GLOBAL FINANCIAL  pitney bowes global financial
13              PITNEY BOWES, INC                   pitney bowes
14                         ORACLE                         oracle
15             ORACLE AMERICA INC                 oracle america
16             ORACLE CORPORATION                         oracle
17                 ORACLE USA INC                     oracle usa

In [44]:
# entity matching function for dataframe created at preprocessing stage - provide dataframe and original column name for names
def entity_matcher_names(dataframe, column_name):
    # group entities using tf-idf to calculate cosine similarities - look for 20% minimum similarity
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_names'], min_similarity = 0.2)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])[column_name].apply('; '.join).reset_index()
    return dataframe

In [45]:
df_unique_entities_names = entity_matcher_names(df_names_cleaned, 'names'); df_unique_entities_names

,unique_entity_ID,unique_entity,names
0,0,marks and spencers,Marks and Spencers Ltd
1,1,ms,M&S Limited
2,2,nvidia ireland,NVIDIA Ireland
3,3,intel,Intel LLC
4,4,at t,AT & T; AT & T MOBILITY; AT&T; AT&T MOBILITY
5,8,dell,DELL INC.
6,9,walmart community,WAL-MART COMMUNITY; WALMART PAYMENTS
7,11,pitney bowes,PITNEY BOWES; PITNEY BOWES GLOBAL FINANCIAL; P...
8,14,oracle,ORACLE; ORACLE AMERICA INC; ORACLE CORPORATION...

In [46]:
# function for processing df of names and clustering them using string similarity
def clustering_names(dataframe, column_name):
    # preprocess dataframe
    df_names_cleaned = preprocess_names(dataframe, column_name)
    # start clustering of names
    print('Entity clustering will start now.')
    start = time.time()
    df_unique_entities_names = entity_matcher_names(df_names_cleaned, column_name)
    time.sleep(1)
    end = time.time()
    # print total time taken
    print(f"Runtime of the program is {end - start} seconds.")
    # create csv with timestamp
    current_time = time.strftime("%Y%m%d-%H%M%S")
    filename = 'names_normalized' + str(current_time) + '.csv'
    # print job status
    print(f"{filename} has been saved in current directory.")
    return df_unique_entities_names.to_csv(filename, index = False)

In [47]:
clustering_names(df_names, 'names')

Entity clustering will start now.
Runtime of the program is 1.0195119380950928 seconds.
names_normalized20210727-114605.csv has been saved in current directory.

In [48]:
# inspect results
pd.read_csv('names_normalized20210725-235626.csv')

,unique_entity_ID,unique_entity,names
0,0,marks and spencers,Marks and Spencers Ltd
1,1,ms,M&S Limited
2,2,nvidia ireland,NVIDIA Ireland
3,3,intel,Intel LLC
4,4,at t,AT & T; AT & T MOBILITY; AT&T; AT&T MOBILITY
5,8,dell,DELL INC.
6,9,walmart community,WAL-MART COMMUNITY; WALMART PAYMENTS
7,11,pitney bowes,PITNEY BOWES; PITNEY BOWES GLOBAL FINANCIAL; P...
8,14,oracle,ORACLE; ORACLE AMERICA INC; ORACLE CORPORATION...

We got issues with M&S Limited unfortunately. In this particular case, the google search scraped link would have performed better than the approach we decided to go with.

## Part 2: General Normalization Engine

**Update**: The final approach will be to use NLI-based Zero Shot Text Classification as a first step. We can use Facebook's [bart-large-mnli](https://huggingface.co/facebook/bart-large-mnli) model and HuggingFace's zero-shot classification pipeline. We could also use the manual approach with native Transformers/PyTorch code if for any reason we didn't like using the former.

My first thought in this part was to use the approach outlined in part 1, with the addition of Named Entity Recognition (NER) right after the text pre-processing step. This would allow to separate all strings into their respective categories (serial numbers, physical goods, locations, company addresses, company names) and would allow us to use the category-specific normalization engines that were built in part 1. The issues are that NER works best when words have a context within a sentence and entity types such as serial numbers and addresses would have to be custom-trained. We would also still be relying on the rule-based cleaning engines developed in part 1 instead of making use of intelligent systems.

In thinking about a solution, I think it could be interesting to explore NER with the spaCy library. An [open-source annotation tool](https://github.com/ManivannanMurugavel/spacy-ner-annotator) can be used to create a dataset that we could use to fine-tune a spaCy NER model. When I say fine-tuning, there are 2 possibilities that both seem like risky hacks: 

Option 1 - Creating new, custom entity types for the entities that don't yet have an entity type (serial number, address, physical goods) and updating a model with these new types. The obvious risk is that we will be run into issues of conflicting entity types. For example ADDRESS vs LOCATION.

Option 2 - This one sounds quite ridiculous. We do not create custom entity types and instead train the model to recognize serial numbers as persons (PER) for example, making sure each category (serial numbers, physical goods, locations, company addresses, company names) have a unique entity type to categorize them.

We could also decide to not fine tune and instead start with a blank model and teach it new entity types. Beyond this NER task, we need to start thinking about alternatives to the rule-based cleaning engines. 

Other ideas to explore:

- Try brute-force approach of grouping all entities, completely ignoring semantics. This will give us a baseline of the performance to beat
- Explore use of Flair library for NER, confidence score is a feature that could be useful.
- [Wikipedia paragraph classification](https://github.com/yashsmehta/named-entity-normalization): Scrape a paragraph from wikipedia describing the entity in question, pass the paragraph through a language model (ie: BERT), feed embedding vector to a shallow classifier to make the prediction of what entity class the new entity belongs to. Could use fastai library for super quick setup/execution.
- Re-explore clustering-based methods for entity normalization.
- Explore viability of Named Entity Linking using Facebook's BLINK library or spaCy.
- Create large dataset for all categories, assemble from all datasets found online so far.
- Dealing with incoming strings: seems like the current approach will hold up with incoming strings, shouldn't worry too much about this.

In [55]:
from transformers import pipeline
classifier = pipeline("zero-shot-classification",
                      model="facebook/bart-large-mnli")

In [95]:
candidate_labels = ['serial number', 'street address', 'city or country', 'physical goods', 'company']

In [96]:
classifier("M&S Limited", candidate_labels)

{'sequence': 'M&S Limited',
 'labels': ['company',
  'physical object',
  'serial number',
  'street address',
  'city or country'],
 'scores': [0.9199535846710205,
  0.045364659279584885,
  0.02406463772058487,
  0.006112602073699236,
  0.004504499491304159]}

In [97]:
df_names

                            names             category
0          Marks and Spencers Ltd              company
1                     M&S Limited              company
2                  NVIDIA Ireland              company
3                       Intel LLC              company
4                          AT & T              company
5                 AT & T MOBILITY              company
6                            AT&T              company
7                   AT&T MOBILITY              company
8                       DELL INC.              company
9              WAL-MART COMMUNITY              company
10               WALMART PAYMENTS              company
11                   PITNEY BOWES  material possession
12  PITNEY BOWES GLOBAL FINANCIAL              company
13              PITNEY BOWES, INC              company
14                         ORACLE  material possession
15             ORACLE AMERICA INC              company
16             ORACLE CORPORATION              company
17                 ORACLE USA INC              company

In [98]:
df_names['category'] = df_names['names'].apply(lambda x: classifier(x, candidate_labels)['labels'][0]); df_names

                            names         category
0          Marks and Spencers Ltd          company
1                     M&S Limited          company
2                  NVIDIA Ireland          company
3                       Intel LLC          company
4                          AT & T          company
5                 AT & T MOBILITY          company
6                            AT&T          company
7                   AT&T MOBILITY          company
8                       DELL INC.          company
9              WAL-MART COMMUNITY          company
10               WALMART PAYMENTS          company
11                   PITNEY BOWES  physical object
12  PITNEY BOWES GLOBAL FINANCIAL          company
13              PITNEY BOWES, INC          company
14                         ORACLE  physical object
15             ORACLE AMERICA INC          company
16             ORACLE CORPORATION          company
17                 ORACLE USA INC          company

## Putting Everything Together

In [200]:
# function that takes in user's input strings as list and returns df with entity type for each string
def get_category(list):
    classifier = pipeline("zero-shot-classification", model="facebook/bart-large-mnli")
    candidate_labels = ['serial number', 'street address', 'city or country', 'physical goods', 'company']
    entity_type = [classifier(i, candidate_labels)['labels'][0] for i in list]
    dataframe = pd.DataFrame(np.column_stack([list, entity_type]), columns=['entity', 'entity_type'])
    return dataframe

# function that takes in dataframe after getting categories for each entity
def preprocess(dataframe):
    # preprocessing steps
    remove_special_characters = lambda x : re.sub(r'[^a-zA-z0-9\s]', '', x)
    lower_strip = lambda x : x.lower().strip().replace('  ', ' ')
    remove_whitespace_serial_nums_only = lambda x : x.replace(' ', '')
    remove_legal_terms_companies_only = lambda x : cleanco(x).clean_name()
    # map reprocessing steps to dataframe
    dataframe['clean_entity'] = dataframe['entity'].map(remove_special_characters).map(lower_strip)
    dataframe.loc[dataframe['entity_type'] == 'serial number', 'clean_entity'] = dataframe['clean_entity'].map(remove_whitespace_serial_nums_only) # preprocessing step for serial numbers only
    dataframe.loc[dataframe['entity_type'] == 'company', 'clean_entity'] = dataframe['clean_entity'].map(remove_legal_terms_companies_only) # preprocessing step for companies only
    return dataframe

# entity matching function
def entity_matcher(dataframe, min_similarity):
    # group entities using tf-idf to calculate cosine similarities
    dataframe[['unique_entity_ID', 'unique_entity']] = group_similar_strings(dataframe['clean_entity'], min_similarity = min_similarity)
    dataframe = dataframe.groupby(['unique_entity_ID', 'unique_entity'])['entity'].apply('; '.join).reset_index()
    return dataframe

# function that clusters entities depending on entity type
def clustering_func(dataframe):
    low_threshold_entity_types = ['city or country', 'physical goods', 'company']
    high_threshold_entity_types = ['serial number', 'street address']
    dataframe_low_threshold = entity_matcher(dataframe[dataframe.entity_type.isin(low_threshold_entity_types)].copy(), min_similarity = 0.2)
    dataframe_high_threshold = entity_matcher(dataframe[dataframe.entity_type.isin(high_threshold_entity_types)].copy(), min_similarity = 0.99)
    dataframe = pd.concat([dataframe_low_threshold, dataframe_high_threshold], ignore_index = True)
    return dataframe

In [201]:
test_list = names + serial_nums + addresses + goods + locations; test_list

['Marks and Spencers Ltd',
 'M&S Limited',
 'NVIDIA Ireland',
 'Intel LLC',
 'AT & T',
 'AT & T MOBILITY',
 'AT&T',
 'AT&T MOBILITY',
 'DELL INC.',
 'WAL-MART COMMUNITY',
 'WALMART PAYMENTS',
 'PITNEY BOWES',
 'PITNEY BOWES GLOBAL FINANCIAL',
 'PITNEY BOWES, INC',
 'ORACLE',
 'ORACLE AMERICA INC',
 'ORACLE CORPORATION',
 'ORACLE USA INC',
 'XYZ 13423 / ILD',
 'ABC/ICL/20891NC',
 'XYZ-13423-ILD',
 'ABCICL-20891NC',
 'XYZ 14 / IKR',
 'DNC/ICL/20891NC',
 'XYK-13423-ILD',
 'SLOUGH SE12 2XY',
 '33 TIMBER YARD, LONDON, L1 8XY',
 '44 CHINA ROAD, KOWLOON, HONG KONG',
 '33, TIMBER YARD, LONDON, L1 8XY',
 'HARDWOOD TABLE',
 'PLASTIC BOTTLE',
 'TOYS',
 'plastic water bottle',
 'Wooden Table',
 'ALUMINIUM TABLE',
 'LONDON',
 'HONG KONG',
 'ASIA',
 'LONDON, ENG',
 'LONDON, GREAT BRITAIN',
 'LONDON, ENGLAND']

In [202]:
categorized_df = get_category(test_list); categorized_df

                               entity      entity_type
0              Marks and Spencers Ltd          company
1                         M&S Limited          company
2                      NVIDIA Ireland          company
3                           Intel LLC          company
4                              AT & T          company
5                     AT & T MOBILITY          company
6                                AT&T          company
7                       AT&T MOBILITY          company
8                           DELL INC.          company
9                  WAL-MART COMMUNITY          company
10                   WALMART PAYMENTS          company
11                       PITNEY BOWES   physical goods
12      PITNEY BOWES GLOBAL FINANCIAL          company
13                  PITNEY BOWES, INC          company
14                             ORACLE          company
15                 ORACLE AMERICA INC          company
16                 ORACLE CORPORATION          company
17                     ORACLE USA INC          company
18                    XYZ 13423 / ILD    serial number
19                    ABC/ICL/20891NC    serial number
20                      XYZ-13423-ILD    serial number
21                     ABCICL-20891NC    serial number
22                       XYZ 14 / IKR   street address
23                    DNC/ICL/20891NC    serial number
24                      XYK-13423-ILD    serial number
25                    SLOUGH SE12 2XY   street address
26     33 TIMBER YARD, LONDON, L1 8XY   street address
27  44 CHINA ROAD, KOWLOON, HONG KONG   street address
28    33, TIMBER YARD, LONDON, L1 8XY   street address
29                     HARDWOOD TABLE   physical goods
30                     PLASTIC BOTTLE   physical goods
31                               TOYS   physical goods
32               plastic water bottle   physical goods
33                       Wooden Table   physical goods
34                    ALUMINIUM TABLE   physical goods
35                             LONDON  city or country
36                          HONG KONG  city or country
37                               ASIA  city or country
38                        LONDON, ENG  city or country
39              LONDON, GREAT BRITAIN  city or country
40                    LONDON, ENGLAND  city or country

In [203]:
cleaned_df = preprocess(categorized_df); cleaned_df

,entity,entity_type,clean_entity
0,Marks and Spencers Ltd,company,marks and spencers
1,M&S Limited,company,ms
2,NVIDIA Ireland,company,nvidia ireland
3,Intel LLC,company,intel
4,AT & T,company,at t
5,AT & T MOBILITY,company,at t mobility
6,AT&T,company,att
7,AT&T MOBILITY,company,att mobility
8,DELL INC.,company,dell
9,WAL-MART COMMUNITY,company,walmart community
10,WALMART PAYMENTS,company,walmart payments
11,PITNEY BOWES,physical goods,pitney bowes
12,PITNEY BOWES GLOBAL FINANCIAL,company,pitney bowes global financial
13,"PITNEY BOWES, INC",company,pitney bowes
14,ORACLE,company,oracle
15,ORACLE AMERICA INC,company,oracle america
16,ORACLE CORPORATION,company,oracle
17,ORACLE USA INC,company,oracle usa
18,XYZ 13423 / ILD,serial number,xyz13423ild
19,ABC/ICL/20891NC,serial number,abcicl20891nc
20,XYZ-13423-ILD,serial number,xyz13423ild
21,ABCICL-20891NC,serial number,abcicl20891nc
22,XYZ 14 / IKR,street address,xyz 14 ikr
23,DNC/ICL/20891NC,serial number,dncicl20891nc
24,XYK-13423-ILD,serial number,xyk13423ild
25,SLOUGH SE12 2XY,street address,slough se12 2xy
26,"33 TIMBER YARD, LONDON, L1 8XY",street address,33 timber yard london l1 8xy
27,"44 CHINA ROAD, KOWLOON, HONG KONG",street address,44 china road kowloon hong kong
28,"33, TIMBER YARD, LONDON, L1 8XY",street address,33 timber yard london l1 8xy
29,HARDWOOD TABLE,physical goods,hardwood table
30,PLASTIC BOTTLE,physical goods,plastic bottle
31,TOYS,physical goods,toys
32,plastic water bottle,physical goods,plastic water bottle
33,Wooden Table,physical goods,wooden table
34,ALUMINIUM TABLE,physical goods,aluminium table
35,LONDON,city or country,london
36,HONG KONG,city or country,hong kong
37,ASIA,city or country,asia
38,"LONDON, ENG",city or country,london eng
39,"LONDON, GREAT BRITAIN",city or country,london great britain
40,"LONDON, ENGLAND",city or country,london england

In [204]:
clustered_df = clustering_func(cleaned_df); clustered_df

,unique_entity_ID,unique_entity,entity
0,0,marks and spencers,Marks and Spencers Ltd
1,1,ms,M&S Limited
2,2,nvidia ireland,NVIDIA Ireland
3,3,intel,Intel LLC
4,4,at t,AT & T; AT & T MOBILITY; AT&T; AT&T MOBILITY
5,8,dell,DELL INC.
6,9,walmart community,WAL-MART COMMUNITY; WALMART PAYMENTS
7,11,pitney bowes,PITNEY BOWES; PITNEY BOWES GLOBAL FINANCIAL; P...
8,14,oracle,ORACLE; ORACLE AMERICA INC; ORACLE CORPORATION...
9,30,plastic bottle,PLASTIC BOTTLE; plastic water bottle
10,31,toys,TOYS
11,33,wooden table,HARDWOOD TABLE; Wooden Table; ALUMINIUM TABLE
12,36,hong kong,HONG KONG
13,37,asia,ASIA
14,38,london eng,"LONDON; LONDON, ENG; LONDON, GREAT BRITAIN; LO..."
15,18,xyz13423ild,XYZ 13423 / ILD; XYZ-13423-ILD
16,19,abcicl20891nc,ABC/ICL/20891NC; ABCICL-20891NC
17,22,xyz 14 ikr,XYZ 14 / IKR
18,23,dncicl20891nc,DNC/ICL/20891NC
19,24,xyk13423ild,XYK-13423-ILD
20,25,slough se12 2xy,SLOUGH SE12 2XY
21,26,33 timber yard london l1 8xy,"33 TIMBER YARD, LONDON, L1 8XY; 33, TIMBER YAR..."
22,27,44 china road kowloon hong kong,"44 CHINA ROAD, KOWLOON, HONG KONG"